garyPenhook/PyAvrOCD/svd/attiny414.svd
        <register>
          <name>EVCTRLA</name>
          <description>EVCTRLA</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRIGEI</name>
              <description>Trigger event enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTION</name>
              <description>Event action</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAULT</name>
                  <description>Event trigger a fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTURE</name>
                  <description>Event trigger a fault and capture</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGE</name>
              <description>Edge select</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALL_LOW</name>
                  <description>The falling edge or low level of event generates retrigger or fault action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_HIGH</name>
                  <description>The rising edge or high level of event generates retrigger or fault action</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG</name>
              <description>Event config</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEITHER</name>
                  <description>Neither Filter nor Asynchronous Event is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER</name>
                  <description>Input Capture Noise Cancellation Filter enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNC</name>
                  <description>Asynchronous Event output qualification enabled</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRLB</name>
          <description>EVCTRLB</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRIGEI</name>
              <description>Trigger event enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTION</name>
              <description>Event action</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAULT</name>
                  <description>Event trigger a fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTURE</name>
                  <description>Event trigger a fault and capture</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGE</name>
              <description>Edge select</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALL_LOW</name>
                  <description>The falling edge or low level of event generates retrigger or fault action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_HIGH</name>
                  <description>The rising edge or high level of event generates retrigger or fault action</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG</name>
              <description>Event config</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEITHER</name>
                  <description>Neither Filter nor Asynchronous Event is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER</name>
                  <description>Input Capture Noise Cancellation Filter enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNC</name>
                  <description>Asynchronous Event output qualification enabled</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FAULTCTRL</name>
          <description>Fault Control</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMPA</name>
              <description>Compare A value</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPB</name>
              <description>Compare B value</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPC</name>
              <description>Compare C value</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPD</name>
              <description>Compare D vaule</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPAEN</name>
              <description>Compare A enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPBEN</name>
              <description>Compare B enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPCEN</name>
              <description>Compare C enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPDEN</name>
              <description>Compare D enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUTCTRLA</name>
          <description>Input Control A</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INPUTMODE</name>
              <description>Input mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Input has no actions</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMPWAIT</name>
                  <description>Stop output, jump to opposite compare cycle and wait</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXECWAIT</name>
                  <description>Stop output, execute opposite compare cycle and wait</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXECFAULT</name>
                  <description>stop output, execute opposite compare cycle while fault active</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ</name>
                  <description>Stop all outputs, maintain frequency</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXECDT</name>
                  <description>Stop all outputs, execute dead time while fault active</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT</name>
                  <description>Stop all outputs, jump to next compare cycle and wait</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITSW</name>
                  <description>Stop all outputs, wait for software action</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGETRIG</name>
                  <description>Stop output on edge, jump to next compare cycle</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGETRIGFREQ</name>
                  <description>Stop output on edge, maintain frequency</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVLTRIGFREQ</name>
                  <description>Stop output at level, maintain frequency</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUTCTRLB</name>
          <description>Input Control B</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INPUTMODE</name>
              <description>Input mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Input has no actions</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMPWAIT</name>
                  <description>Stop output, jump to opposite compare cycle and wait</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXECWAIT</name>
                  <description>Stop output, execute opposite compare cycle and wait</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXECFAULT</name>
                  <description>stop output, execute opposite compare cycle while fault active</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ</name>
                  <description>Stop all outputs, maintain frequency</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXECDT</name>
                  <description>Stop all outputs, execute dead time while fault active</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT</name>
                  <description>Stop all outputs, jump to next compare cycle and wait</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITSW</name>
                  <description>Stop all outputs, wait for software action</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGETRIG</name>
                  <description>Stop output on edge, jump to next compare cycle</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGETRIGFREQ</name>
                  <description>Stop output on edge, maintain frequency</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVLTRIGFREQ</name>
                  <description>Stop output at level, maintain frequency</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCTRL</name>
          <description>Interrupt Control</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OVF</name>
              <description>Overflow interrupt enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGA</name>
              <description>Trigger A interrupt enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGB</name>
              <description>Trigger B interrupt enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OVF</name>
              <description>Overflow interrupt enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGA</name>
              <description>Trigger A interrupt enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGB</name>
              <description>Trigger B interrupt enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0xE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENRDY</name>
              <description>Enable ready</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMDRDY</name>
              <description>Command ready</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWMACTA</name>
              <description>PWM activity on A</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMACTB</name>
              <description>PWM activity on B</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
